{
	"class_name": "Sequential",
	"config": {
		"name": "sequential_14",
		"layers": [{
			"class_name": "InputLayer",
			"config": {
				"batch_input_shape": [null, 28, 28, 1],
				"dtype": "float32",
				"sparse": false,
				"ragged": false,
				"name": "conv2d_98_input"
			}
		}, {
			"class_name": "Conv2D",
			"config": {
				"name": "conv2d_98",
				"trainable": true,
				"batch_input_shape": [null, 28, 28, 1],
				"dtype": "float32",
				"filters": 32,
				"kernel_size": [3, 3],
				"strides": [1, 1],
				"padding": "valid",
				"data_format": "channels_last",
				"dilation_rate": [1, 1],
				"activation": "relu",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}, {
			"class_name": "BatchNormalization",
			"config": {
				"name": "batch_normalization_98",
				"trainable": true,
				"dtype": "float32",
				"axis": [3],
				"momentum": 0.99,
				"epsilon": 0.001,
				"center": true,
				"scale": true,
				"beta_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"gamma_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"moving_mean_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"moving_variance_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"beta_regularizer": null,
				"gamma_regularizer": null,
				"beta_constraint": null,
				"gamma_constraint": null
			}
		}, {
			"class_name": "Conv2D",
			"config": {
				"name": "conv2d_99",
				"trainable": true,
				"dtype": "float32",
				"filters": 32,
				"kernel_size": [3, 3],
				"strides": [1, 1],
				"padding": "valid",
				"data_format": "channels_last",
				"dilation_rate": [1, 1],
				"activation": "relu",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}, {
			"class_name": "BatchNormalization",
			"config": {
				"name": "batch_normalization_99",
				"trainable": true,
				"dtype": "float32",
				"axis": [3],
				"momentum": 0.99,
				"epsilon": 0.001,
				"center": true,
				"scale": true,
				"beta_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"gamma_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"moving_mean_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"moving_variance_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"beta_regularizer": null,
				"gamma_regularizer": null,
				"beta_constraint": null,
				"gamma_constraint": null
			}
		}, {
			"class_name": "Conv2D",
			"config": {
				"name": "conv2d_100",
				"trainable": true,
				"dtype": "float32",
				"filters": 32,
				"kernel_size": [5, 5],
				"strides": [2, 2],
				"padding": "same",
				"data_format": "channels_last",
				"dilation_rate": [1, 1],
				"activation": "relu",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}, {
			"class_name": "BatchNormalization",
			"config": {
				"name": "batch_normalization_100",
				"trainable": true,
				"dtype": "float32",
				"axis": [3],
				"momentum": 0.99,
				"epsilon": 0.001,
				"center": true,
				"scale": true,
				"beta_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"gamma_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"moving_mean_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"moving_variance_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"beta_regularizer": null,
				"gamma_regularizer": null,
				"beta_constraint": null,
				"gamma_constraint": null
			}
		}, {
			"class_name": "Dropout",
			"config": {
				"name": "dropout_42",
				"trainable": true,
				"dtype": "float32",
				"rate": 0.4,
				"noise_shape": null,
				"seed": null
			}
		}, {
			"class_name": "Conv2D",
			"config": {
				"name": "conv2d_101",
				"trainable": true,
				"dtype": "float32",
				"filters": 64,
				"kernel_size": [3, 3],
				"strides": [1, 1],
				"padding": "valid",
				"data_format": "channels_last",
				"dilation_rate": [1, 1],
				"activation": "relu",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}, {
			"class_name": "BatchNormalization",
			"config": {
				"name": "batch_normalization_101",
				"trainable": true,
				"dtype": "float32",
				"axis": [3],
				"momentum": 0.99,
				"epsilon": 0.001,
				"center": true,
				"scale": true,
				"beta_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"gamma_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"moving_mean_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"moving_variance_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"beta_regularizer": null,
				"gamma_regularizer": null,
				"beta_constraint": null,
				"gamma_constraint": null
			}
		}, {
			"class_name": "Conv2D",
			"config": {
				"name": "conv2d_102",
				"trainable": true,
				"dtype": "float32",
				"filters": 64,
				"kernel_size": [3, 3],
				"strides": [1, 1],
				"padding": "valid",
				"data_format": "channels_last",
				"dilation_rate": [1, 1],
				"activation": "relu",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}, {
			"class_name": "BatchNormalization",
			"config": {
				"name": "batch_normalization_102",
				"trainable": true,
				"dtype": "float32",
				"axis": [3],
				"momentum": 0.99,
				"epsilon": 0.001,
				"center": true,
				"scale": true,
				"beta_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"gamma_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"moving_mean_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"moving_variance_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"beta_regularizer": null,
				"gamma_regularizer": null,
				"beta_constraint": null,
				"gamma_constraint": null
			}
		}, {
			"class_name": "Conv2D",
			"config": {
				"name": "conv2d_103",
				"trainable": true,
				"dtype": "float32",
				"filters": 64,
				"kernel_size": [5, 5],
				"strides": [2, 2],
				"padding": "same",
				"data_format": "channels_last",
				"dilation_rate": [1, 1],
				"activation": "relu",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}, {
			"class_name": "BatchNormalization",
			"config": {
				"name": "batch_normalization_103",
				"trainable": true,
				"dtype": "float32",
				"axis": [3],
				"momentum": 0.99,
				"epsilon": 0.001,
				"center": true,
				"scale": true,
				"beta_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"gamma_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"moving_mean_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"moving_variance_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"beta_regularizer": null,
				"gamma_regularizer": null,
				"beta_constraint": null,
				"gamma_constraint": null
			}
		}, {
			"class_name": "Dropout",
			"config": {
				"name": "dropout_43",
				"trainable": true,
				"dtype": "float32",
				"rate": 0.4,
				"noise_shape": null,
				"seed": null
			}
		}, {
			"class_name": "Conv2D",
			"config": {
				"name": "conv2d_104",
				"trainable": true,
				"dtype": "float32",
				"filters": 128,
				"kernel_size": [4, 4],
				"strides": [1, 1],
				"padding": "valid",
				"data_format": "channels_last",
				"dilation_rate": [1, 1],
				"activation": "relu",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}, {
			"class_name": "BatchNormalization",
			"config": {
				"name": "batch_normalization_104",
				"trainable": true,
				"dtype": "float32",
				"axis": [3],
				"momentum": 0.99,
				"epsilon": 0.001,
				"center": true,
				"scale": true,
				"beta_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"gamma_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"moving_mean_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"moving_variance_initializer": {
					"class_name": "Ones",
					"config": {}
				},
				"beta_regularizer": null,
				"gamma_regularizer": null,
				"beta_constraint": null,
				"gamma_constraint": null
			}
		}, {
			"class_name": "Flatten",
			"config": {
				"name": "flatten_14",
				"trainable": true,
				"dtype": "float32",
				"data_format": "channels_last"
			}
		}, {
			"class_name": "Dropout",
			"config": {
				"name": "dropout_44",
				"trainable": true,
				"dtype": "float32",
				"rate": 0.4,
				"noise_shape": null,
				"seed": null
			}
		}, {
			"class_name": "Dense",
			"config": {
				"name": "dense_14",
				"trainable": true,
				"dtype": "float32",
				"units": 10,
				"activation": "softmax",
				"use_bias": true,
				"kernel_initializer": {
					"class_name": "GlorotUniform",
					"config": {
						"seed": null
					}
				},
				"bias_initializer": {
					"class_name": "Zeros",
					"config": {}
				},
				"kernel_regularizer": null,
				"bias_regularizer": null,
				"activity_regularizer": null,
				"kernel_constraint": null,
				"bias_constraint": null
			}
		}]
	},
	"keras_version": "2.4.0",
	"backend": "tensorflow"
}